БухЭксп/Reports/CW_ОтчетАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОтчетАгента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаПодписывающиеДокументы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжностьАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыЛицПодписывающихДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ВознаграждениеПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ВознаграждениеПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>База</Name>
					<Comment>База для расчета вознаграждения в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыАвтоматическогоРасчетаВознаграждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыАвтоматическогоРасчетаВознаграждения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтСуммы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Reports/CW_ОтчетАгента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ОтчетВывести(ТабДок) Экспорт 
	ПостроительОтчетаОтчет = ПостроительОтчета;
	
    ПостроительОтчетаОтчет.Параметры.Очистить();
	ПостроительОтчетаОтчет.Параметры.Вставить("Дата1", НачПериода);
	ПостроительОтчетаОтчет.Параметры.Вставить("Дата2", КонецДня(КонПериода));
	ПостроительОтчетаОтчет.Параметры.Вставить("Контрагент", Контрагент);
	ПостроительОтчетаОтчет.Параметры.Вставить("Договор", 	Договор);
	ПостроительОтчетаОтчет.Параметры.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
	ПостроительОтчетаОтчет.Выполнить();
	
	Если ПостроительОтчетаОтчет.Результат.Пустой() Тогда 
		ТабДок.Область(1,1).Текст = "Нет данных за указанный период";
		Возврат(Ложь);
	КонецЕсли;
	
	// Формирование табличного документа
	ТабДок.Очистить();
	
	МакетОтчета = ПолучитьМакет("Макет");	
	
	// Сформируем область итогов, не выводя пока что
	ВыборкаОбщийИтог = ПостроительОтчетаОтчет.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	
	Если ЗначениеЗаполнено(ВыборкаОбщийИтог.БазаРубОборот) Тогда 
		естьБаза = Истина;
	Иначе 
		естьБаза = Ложь;
	КонецЕсли;
	
	Если естьБаза Тогда 
		ОбластьОбщихИтогов = МакетОтчета.ПолучитьОбласть("ОбщиеИтоги");
		ОбластьОбщихИтогов.Параметры.Заполнить(ВыборкаОбщийИтог);
	Иначе 
		ОбластьОбщихИтогов = МакетОтчета.ПолучитьОбласть("ОбщиеИтоги|ЛеваяЧасть");
		ОбластьОбщихИтогов.Параметры.Заполнить(ВыборкаОбщийИтог);
		ОбластьОбщихИтогов2 = МакетОтчета.ПолучитьОбласть("ОбщиеИтоги|ПраваяЧасть");
		ОбластьОбщихИтогов2.Параметры.Заполнить(ВыборкаОбщийИтог);
	КонецЕсли;
	
	Если ВыборкаОбщийИтог.КоличествоРазличныхВариантовРасчетаВознаграждения > 1 Тогда 
		Сообщить("Обнаружено "+ВыборкаОбщийИтог.КоличествоРазличныхВариантовРасчетаВознаграждения + " различных вариантов расчета вознаграждения!");
	КонецЕсли;
	Если ВыборкаОбщийИтог.КоличествоРазличныхВалют > 1 Тогда 
		Сообщить("Обнаружено "+ВыборкаОбщийИтог.КоличествоРазличныхВалют + " различных валют начисления вознаграждения!");
	КонецЕсли;
	
	Если естьБаза Тогда 
		Область = МакетОтчета.ПолучитьОбласть("Заголовок");
	Иначе 
		Область = МакетОтчета.ПолучитьОбласть("Заголовок|ЛеваяЧасть");
	КонецЕсли;						
								
	Область.Параметры.НомерДоговора = СокрЛП(Договор.НомерДоговора);
	Область.параметры.ДатаДоговора  = Формат(Договор.ДатаДоговора, "ДФ=dd.MM.yy") + " г.";
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= КонПериода;
	СтруктураПараметров.Договор 			= Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "РасчетныйСчетОрганизации");
	РСчет 				= ПараметрыДоговора.РасчетныйСчетОрганизации;
	
	Если НЕ ЗначениеЗаполнено(РСчет) Тогда
		БанкИсполнителя = Договор.Организация.ОсновнойБанковскийСчет.Банк;
		БанковскийСчет = Договор.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
		НомерСчета = Договор.Организация.ОсновнойБанковскийСчет.НомерСчета;
		БИК = Договор.Организация.ОсновнойБанковскийСчет.Банк.Код;
	Иначе
		БанкИсполнителя = РСчет.Банк;
		БанковскийСчет = РСчет.Банк.КоррСчет;
		НомерСчета = РСчет.НомерСчета;
		БИК = РСчет.Банк.Код;
	КонецЕсли;

	Исполнитель = Договор.Организация.НаименованиеСокращенное;
	ИННИсполнителя = Договор.Организация.ИНН;
	КППИсполнителя = Договор.Организация.КПП;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= КонПериода;
	СтруктураПараметров.Договор 			= Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	АдресИсполнителя 	= ПараметрыДоговора.АдресОрганизации;
	АдресПолучателя 	= ПараметрыДоговора.Адрес;
	
	Получатель=Контрагент.НаименованиеПолное;
	
	СчетПолучателя = ПараметрыДоговора.РасчетныйСчет;
	Если СчетПолучателя = Неопределено ИЛИ СчетПолучателя.Пустая() Тогда
		БанкПолучателя=Контрагент.ОсновнойБанковскийСчет.Банк;
		БанковскийСчетПолучателя=Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет;
		НомерСчетаПолучателя=Контрагент.ОсновнойБанковскийСчет.НомерСчета;
		БИКПолучателя=Контрагент.ОсновнойБанковскийСчет.Банк.Код;
	Иначе
		БанкПолучателя = СчетПолучателя.Банк;
		БанковскийСчетПолучателя = СчетПолучателя.Банк.КоррСчет;
		НомерСчетаПолучателя = СчетПолучателя.НомерСчета;
		БИКПолучателя = СчетПолучателя.Банк.Код;
	КонецЕсли;	
	
	ИННПолучателя=Контрагент.ИНН;
	КПППолучателя=Контрагент.КПП;
	
	Область.Параметры.Исполнитель = Исполнитель + Символы.ПС + "ИНН/КПП: " + ИННИсполнителя + "/" + КППИсполнителя + Символы.ПС 
									+ "Адрес: " + АдресИсполнителя + Символы.ПС + "Р/счет: " + НомерСчета + Символы.ПС  
									+ БанкИсполнителя + Символы.ПС + "К/счет: " + БанковскийСчет + Символы.ПС + "БИК: " + БИК;
	
	Если естьБаза Тогда 
		Область.Параметры.Заказчик = Получатель + Символы.ПС + "ИНН/КПП: " + ИННПолучателя + "/" + КПППолучателя + Символы.ПС 
								 + "Адрес: " + АдресПолучателя + Символы.ПС + "Р/счет: " + НомерСчетаПолучателя + Символы.ПС 
								 + БанкПолучателя + Символы.ПС + "К/счет: " + БанковскийСчетПолучателя + Символы.ПС + "БИК: " + БИКПолучателя;
		ТабДок.Вывести(Область);
	Иначе 
		ТабДок.Вывести(Область);
		Область = МакетОтчета.ПолучитьОбласть("Заголовок|ПраваяЧасть");
		Область.Параметры.Заказчик = Получатель + Символы.ПС + "ИНН/КПП: " + ИННПолучателя + "/" + КПППолучателя + Символы.ПС 
								 + "Адрес: " + АдресПолучателя + Символы.ПС + "Р/счет: " + НомерСчетаПолучателя + Символы.ПС 
								 + БанкПолучателя + Символы.ПС + "К/счет: " + БанковскийСчетПолучателя + Символы.ПС + "БИК: " + БИКПолучателя;
		ТабДок.Присоединить(Область);
	КонецЕсли;								
	
	// заполним и выведем шапку таблицы
	Если естьБаза Тогда 
		Область = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	Иначе 
		Область = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы|ЛеваяЧасть");
	КонецЕсли;
	Если ВыборкаОбщийИтог.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда 
		Область.Параметры.ПроцентЛибоСумма = "%";
	ИначеЕсли ВыборкаОбщийИтог.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ФиксированнаяСумма Тогда 
		Область.Параметры.ПроцентЛибоСумма = ""+Договор.ВалютаДоговора;
	Иначе
		Область.Параметры.ПроцентЛибоСумма = "?";
	КонецЕсли;
	
	Если естьБаза Тогда 
		Область.Параметры.ВалютаДоговора = Договор.ВалютаДоговора;
		ТабДок.Вывести(Область);
	Иначе 
		ТабДок.Вывести(Область);
		Область = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы|ПраваяЧасть");
		Область.Параметры.ВалютаДоговора = Договор.ВалютаДоговора;
		ТабДок.Присоединить(Область);
	КонецЕсли;
	
	ЧислоГруппировок = ПостроительОтчетаОтчет.ИзмеренияСтроки.Количество();
	
	ВыводГруппировок(ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), ЧислоГруппировок, МакетОтчета, ТабДок, ЕстьБаза);
		
	Если естьБаза Тогда 
		ТабДок.Вывести(ОбластьОбщихИтогов, ВыборкаОбщийИтог.Уровень());
	Иначе 
		ТабДок.Вывести(ОбластьОбщихИтогов, ВыборкаОбщийИтог.Уровень());
		ТабДок.Присоединить(ОбластьОбщихИтогов2, ВыборкаОбщийИтог.Уровень());
	КонецЕсли;
	
	Область = МакетОтчета.ПолучитьОбласть("Подписи");
		
	// получим должность руководителя из доп.реквизитов контрагента
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= КонПериода;
	СтруктураПараметров.Договор 			= Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	Тмп 				= ПараметрыДоговора.ДолжностьРуководителя;

	Область.Параметры.ДолжностьРуководителяЗаказчика = ?(ПустаяСтрока(Тмп),"Руководитель предприятия ", СокрЛП(Тмп) + " ");
	
	Область.Параметры.ИсполнительНаименование = Исполнитель;
	Область.Параметры.ПолучательНаименование = Получатель;
	
	Подписанты = ВернутьПодписантов(Договор.Организация, КонПериода, ПараметрыДоговора); 
	Область.Параметры.ДолжностьРуководителя = Подписанты.РуководительДолжностьРус;
	Область.Параметры.ФИОРуководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,НачПериода) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", ""); 
	
	Область.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,НачПериода);
	
	ТабДок.Вывести(Область);

	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб=Истина;
	
	Возврат Истина;
	
КонецФункции

Функция ВернутьПодписантов(Знач Организация, Дата, ПараметрыДоговора) Экспорт
	
	Ответ = Новый Структура;
	
	Если ПараметрыДоговора.РежимПодписей = 0  Тогда
		
		ВладелецПараметров = ПараметрыДоговора.Договор;
		Если ТипЗнч(ВладелецПараметров) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			Организация = ВладелецПараметров.Организация;
		Иначе
			Организация = ВладелецПараметров.Договор.Организация;
		КонецЕсли;
		
		ДанныеОтветственных = РегистрыСведений.CW_ПараметрыДоговоров.ПолучитьОтветственныхЛицИзКарточкиОрганизации(Организация, Дата);
		
		Ответ.Вставить("Руководитель",              ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительПоДоговору",	ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус",	ДанныеОтветственных.ДолжностьРуководителя);
		Ответ.Вставить("РуководительОснованиеРус",  "");
		
		Ответ.Вставить("ГлБух",						ДанныеОтветственных.ГлавныйБухгалтер);
		Ответ.Вставить("ГлБухОснованиеРус",			ДанныеОтветственных.ГлавныйБухгалтер);
		
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 1 Тогда
		
		Ответ.Вставить("Руководитель",             ПараметрыДоговора.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус", ПараметрыДоговора.ДолжностьРуководителяОрганизации);
		Ответ.Вставить("РуководительДолжностьАнг", ПараметрыДоговора.ДолжностьРуководителяОрганизацииАнгл);
		Ответ.Вставить("РуководительОснованиеРус", ПараметрыДоговора.РуководительОснование);
		Ответ.Вставить("РуководительОснованиеАнг", ПараметрыДоговора.РуководительОснованиеАнгл);
		
		Ответ.Вставить("ГлБух",             ПараметрыДоговора.ГлавныйБухгалтерОрганизации);
		Ответ.Вставить("ГлБухОснованиеРус", ПараметрыДоговора.ГлавныйБухгалтерОснование);
		Ответ.Вставить("ГлБухОснованиеАнг", ПараметрыДоговора.ГлавныйБухгалтерОснованиеАнгл);
		
		
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 2 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.Руководитель,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжность,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжностьАнгл,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснование,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснованиеАнгл,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтер,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснование,
		|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснованиеАнгл
		|ИЗ
		|	РегистрСведений.CW_ЛицаПодписывающиеДокументы.СрезПоследних(
		|			&Дата,
		|			Вариант = &Вариант
		|				И Организация = &Организация) КАК CW_ЛицаПодписывающиеДокументыСрезПоследних";
		Запрос.УстановитьПараметр("Вариант", ПараметрыДоговора.ВариантПодписей);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Дата", Дата);
		ТЗ = Запрос.Выполнить().Выбрать();
		Если ТЗ.Следующий() Тогда
			Ответ.Вставить("Руководитель",             ТЗ.Руководитель);
			Ответ.Вставить("РуководительДолжностьРус", ТЗ.РуководительДолжность);
			Ответ.Вставить("РуководительДолжностьАнг", ТЗ.РуководительДолжностьАнгл);
			Ответ.Вставить("РуководительОснованиеРус", ТЗ.РуководительОснование);
			Ответ.Вставить("РуководительОснованиеАнг", ТЗ.РуководительОснованиеАнгл);
			
			Ответ.Вставить("ГлБух",             ТЗ.ГлБухгалтер);
			Ответ.Вставить("ГлБухОснованиеРус", ТЗ.ГлБухгалтерОснование);
			Ответ.Вставить("ГлБухОснованиеАнг", ТЗ.ГлБухгалтерОснованиеАнгл);
		Иначе
			Ответ.Вставить("Руководитель",             "");
			Ответ.Вставить("РуководительДолжностьРус", "");
			Ответ.Вставить("РуководительДолжностьАнг", "");
			Ответ.Вставить("РуководительОснованиеРус", "");
			Ответ.Вставить("РуководительОснованиеАнг", "");
			
			Ответ.Вставить("ГлБух",             "");
			Ответ.Вставить("ГлБухОснованиеРус", "");
			Ответ.Вставить("ГлБухОснованиеАнг", "");
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

Процедура ВыводГруппировок(ВыборкаТекущегоУровня, ЧислоГруппировок, МакетОтчета, ТаблДок, ЕстьБаза)
	
	нпп=0;
	Пока ВыборкаТекущегоУровня.Следующий() Цикл 
		нпп=нпп+1;
		        		
		Если ЕстьБаза Тогда 
			Область = МакетОтчета.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаТекущегоУровня); 
			Область.Параметры.Номер = нпп;
			//Область.Параметры.Группировка = ВыборкаТекущегоУровня[ПостроительОтчетаОтчет.ИзмеренияСтроки.Получить(ВыборкаТекущегоУровня.Уровень() - 1).Имя];
			//Область.Параметры.Расшифровка = ВыборкаТекущегоУровня[ПостроительОтчетаОтчет.ИзмеренияСтроки.Получить(ВыборкаТекущегоУровня.Уровень() - 1).Имя];
			ТаблДок.Вывести(Область, ВыборкаТекущегоУровня.Уровень());	
		Иначе 
			обл1 = МакетОтчета.ПолучитьОбласть("Строка|ЛеваяЧасть");
			обл2 = МакетОтчета.ПолучитьОбласть("Строка|ПраваяЧасть");
			обл1.Параметры.Заполнить(ВыборкаТекущегоУровня); 
			обл1.Параметры.Номер = нпп;
			обл2.Параметры.Заполнить(ВыборкаТекущегоУровня); 
			ТаблДок.Вывести(обл1, ВыборкаТекущегоУровня.Уровень());	
			ТаблДок.Присоединить(обл2, ВыборкаТекущегоУровня.Уровень());
		КонецЕсли;
			
		// Перейдем на нижний уровень
		//---------------------------------------------------------------------------------------
		Если ВыборкаТекущегоУровня.Уровень() < ЧислоГруппировок Тогда                     		
			ВыборкаСледующегоУровня = ВыборкаТекущегоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ВыводГруппировок(ВыборкаСледующегоУровня, ЧислоГруппировок,  МакетОтчета, ТаблДок, ЕстьБаза);
		Иначе 
			//ВыборкаСледующегоУровня = ВыборкаТекущегоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//ВыводДетальныхЗаписей(ВыборкаСледующегоУровня, МакетОтчета, ТаблДок);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ВыводДетальныхЗаписей(ВыборкаТекущегоУровня, МакетОтчета, ТаблДок)
		
	Пока ВыборкаТекущегоУровня.Следующий() Цикл 
		        		
		// Выведим область
		Область = МакетОтчета.ПолучитьОбласть("ДетальныеЗаписи");
		Область.Параметры.Заполнить(ВыборкаТекущегоУровня); 
		Область.Параметры.ДокументыСтрокой = ВыборкаТекущегоУровня.Документ.ПредставлениеДокумента;
		
		ТаблДок.Вывести(Область, ВыборкаТекущегоУровня.Уровень());	
					
	КонецЦикла;
		
КонецПроцедуры

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Инициализация параметров построителя отчета.
//
//*******************************************************************************************
Процедура ОтчетИнициализация() Экспорт;
	
	ПостроительОтчетаОтчет = ПостроительОтчета;
	
	ПостроительОтчетаОтчет.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Период КАК ПериодДвижения,
		|	МАКСИМУМ(CW_ПараметрыДоговоров.Период) КАК ПериодПараметровДоговора,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Контрагент КАК Контрагент,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Договор КАК Договор,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ПриложениеКДоговору КАК ПриложениеКДоговору,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Грузоперевозка КАК Грузоперевозка,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ДокументРасходов КАК ДокументРасходов,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.БазаОборот КАК БазаРубОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Всего_ВалютаОборот КАК ВсегоВалОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ВсегоОборот КАК ВсегоРубОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.СуммаОборот КАК СуммаРубОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.НДСОборот КАК НДСРубОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.НДС_ВалютаОборот КАК НДСВалОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Регистратор.Валюта КАК РегистраторВалюта,
		|	CW_ПараметрыДоговоров.АвтоматическийРасчетВознаграждения КАК АвтоматическийРасчетВознаграждения,
		|	CW_ПараметрыДоговоров.ВариантРасчетаВознаграждения КАК ВариантРасчетаВознаграждения,
		|	CW_ПараметрыДоговоров.РазмерАгентскогоВознаграждения КАК РазмерАгентскогоВознаграждения
		|ПОМЕСТИТЬ втОборотыСПериодами
		|ИЗ
		|	РегистрНакопления.CW_ВознаграждениеПоГрузоперевозкам.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			Контрагент = &Контрагент
		|				И Договор = &Договор
		|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ВознаграждениеПоГрузоперевозкамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПараметрыДоговоров КАК CW_ПараметрыДоговоров
		|		ПО (ВЫБОР
		|				КОГДА CW_ВознаграждениеПоГрузоперевозкамОбороты.ПриложениеКДоговору <> ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка)
		|					ТОГДА CW_ВознаграждениеПоГрузоперевозкамОбороты.ПриложениеКДоговору = CW_ПараметрыДоговоров.Договор
		|				ИНАЧЕ CW_ВознаграждениеПоГрузоперевозкамОбороты.Договор = CW_ПараметрыДоговоров.Договор
		|			КОНЕЦ)
		|			И CW_ВознаграждениеПоГрузоперевозкамОбороты.Период >= CW_ПараметрыДоговоров.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Грузоперевозка,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Период,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.БазаОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Всего_ВалютаОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ВсегоОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.СуммаОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.НДСОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.НДС_ВалютаОборот,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Контрагент,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Договор,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ДокументРасходов,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.Регистратор.Валюта,
		|	CW_ВознаграждениеПоГрузоперевозкамОбороты.ПриложениеКДоговору,
		|	CW_ПараметрыДоговоров.АвтоматическийРасчетВознаграждения,
		|	CW_ПараметрыДоговоров.ВариантРасчетаВознаграждения,
		|	CW_ПараметрыДоговоров.РазмерАгентскогоВознаграждения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОборотыСПериодами.Грузоперевозка КАК Грузоперевозка,
		|	втОборотыСПериодами.БазаРубОборот КАК БазаРубОборот,
		|	втОборотыСПериодами.ВсегоВалОборот КАК ВсегоВалОборот,
		|	втОборотыСПериодами.ВсегоРубОборот КАК ВсегоРубОборот,
		|	втОборотыСПериодами.СуммаРубОборот КАК СуммаРубОборот,
		|	втОборотыСПериодами.НДСРубОборот КАК НДСРубОборот,
		|	втОборотыСПериодами.НДСВалОборот КАК НДСВалОборот,
		|	втОборотыСПериодами.ПериодДвижения КАК ПериодДвижения,
		|	втОборотыСПериодами.ПериодПараметровДоговора КАК ПериодПараметровДоговора,
		|	втОборотыСПериодами.Контрагент КАК Контрагент,
		|	втОборотыСПериодами.Договор КАК Договор,
		|	втОборотыСПериодами.ДокументРасходов КАК ДокументРасходов,
		|	втОборотыСПериодами.АвтоматическийРасчетВознаграждения КАК АвтоматическийРасчетВознаграждения,
		|	втОборотыСПериодами.ВариантРасчетаВознаграждения КАК ВариантРасчетаВознаграждения,
		|	втОборотыСПериодами.РазмерАгентскогоВознаграждения КАК РазмерАгентскогоВознаграждения,
		|	втОборотыСПериодами.РегистраторВалюта КАК РегистраторВалюта
		|ПОМЕСТИТЬ втОборотыСПараметрами
		|ИЗ
		|	втОборотыСПериодами КАК втОборотыСПериодами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОборотыСПараметрами.РегистраторВалюта) КАК КоличествоРазличныхВалют
		|ПОМЕСТИТЬ втКонтрольВалют
		|ИЗ
		|	втОборотыСПараметрами КАК втОборотыСПараметрами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОборотыСПараметрами.ВариантРасчетаВознаграждения) КАК КоличествоРазличныхВариантовРасчетаВознаграждения
		|ПОМЕСТИТЬ втКонтрольВариантовРасчета
		|ИЗ
		|	втОборотыСПараметрами КАК втОборотыСПараметрами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОборотыСПараметрами.Грузоперевозка КАК Грузоперевозка,
		|	СУММА(втОборотыСПараметрами.БазаРубОборот) КАК БазаРубОборот,
		|	СУММА(втОборотыСПараметрами.ВсегоВалОборот) КАК ВсегоВалОборот,
		|	СУММА(втОборотыСПараметрами.НДСВалОборот) КАК НДСВалОборот,
		|	МАКСИМУМ(втОборотыСПараметрами.РазмерАгентскогоВознаграждения) КАК РазмерАгентскогоВознаграждения,
		|	МАКСИМУМ(втОборотыСПараметрами.ВариантРасчетаВознаграждения) КАК ВариантРасчетаВознаграждения
		|ПОМЕСТИТЬ втСвернуто
		|{ВЫБРАТЬ
		|	Грузоперевозка.*,
		|	БазаРубОборот,
		|	ВсегоВалОборот,
		|	НДСВалОборот}
		|ИЗ
		|	втОборотыСПараметрами КАК втОборотыСПараметрами
		|
		|СГРУППИРОВАТЬ ПО
		|	втОборотыСПараметрами.Грузоперевозка
		|{УПОРЯДОЧИТЬ ПО
		|	Грузоперевозка.*}
		|{ИТОГИ ПО
		|	Грузоперевозка.*}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСвернуто.Грузоперевозка КАК Грузоперевозка,
		|	втСвернуто.БазаРубОборот КАК БазаРубОборот,
		|	втСвернуто.ВсегоВалОборот КАК ВсегоВалОборот,
		|	втСвернуто.НДСВалОборот КАК НДСВалОборот,
		|	втСвернуто.РазмерАгентскогоВознаграждения КАК РазмерАгентскогоВознаграждения,
		|	втСвернуто.ВариантРасчетаВознаграждения КАК ВариантРасчетаВознаграждения,
		|	втКонтрольВариантовРасчета.КоличествоРазличныхВариантовРасчетаВознаграждения КАК КоличествоРазличныхВариантовРасчетаВознаграждения,
		|	втКонтрольВалют.КоличествоРазличныхВалют КАК КоличествоРазличныхВалют
		|{ВЫБРАТЬ
		|	Грузоперевозка.*,
		|	БазаРубОборот,
		|	ВсегоВалОборот,
		|	НДСВалОборот,
		|	РазмерАгентскогоВознаграждения,
		|	ВариантРасчетаВознаграждения.*,
		|	КоличествоРазличныхВариантовРасчетаВознаграждения,
		|	КоличествоРазличныхВалют}
		|ИЗ
		|	втСвернуто КАК втСвернуто,
		|	втКонтрольВариантовРасчета КАК втКонтрольВариантовРасчета,
		|	втКонтрольВалют КАК втКонтрольВалют
		|{УПОРЯДОЧИТЬ ПО
		|	Грузоперевозка.*}
		|ИТОГИ
		|	СУММА(БазаРубОборот),
		|	СУММА(ВсегоВалОборот),
		|	СУММА(НДСВалОборот),
		|	МАКСИМУМ(РазмерАгентскогоВознаграждения),
		|	МАКСИМУМ(ВариантРасчетаВознаграждения),
		|	МАКСИМУМ(КоличествоРазличныхВариантовРасчетаВознаграждения),
		|	МАКСИМУМ(КоличествоРазличныхВалют)
		|ПО
		|	ОБЩИЕ,
		|	Грузоперевозка
		|{ИТОГИ ПО
		|	Грузоперевозка.*}"
	;
			
	ПостроительОтчетаОтчет.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаОтчет.ТекстЗаголовка = "Отчет";
	
	
	ПостроительОтчетаОтчет.Порядок.Очистить();
	ПостроительОтчетаОтчет.ВыбранныеПоля.Очистить();
	
	Для Каждого полеД из ПостроительОтчетаОтчет.ДоступныеПоля Цикл 		
		
		Если полеД.Поле Тогда 
			ПостроительОтчетаОтчет.ВыбранныеПоля.Добавить(полеД.ПутьКДанным, полеД.Имя).Представление = полеД.Представление;
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	ПостроительОтчетаОтчет.ИзмеренияСтроки.Очистить();
	ПостроительОтчетаОтчет.ИзмеренияСтроки.Добавить("Грузоперевозка");
	
КонецПроцедуры

#КонецЕсли
